//$Source$
//------------------------------------------------------------------------------
// mod
//------------------------------------------------------------------------------
/**
 * @file mod.cpp
 * @author Javier Jiménez Santana
 * @date 09/05/2024
 */
//------------------------------------------------------------------------------

#include "../include/mod.hpp"

//------------------------------------------------------------------------------
//  double mod(double x, double y)
//------------------------------------------------------------------------------
/**
 * Calcula el resto de la división de x entre y, igual que en Matlab.
 *
 * @param x Dividendo.
 * @param y Divisor.
 * @return Resto de la división.
 */
//------------------------------------------------------------------------------
double mod(double x, double y)
{
    double r = fmod(x, y);
    if (r < 0.0)
    {
        r += y;
    }
    return r;
}